package nb.additional;

public enum SignerBank {
    Glushchenko("Глущенко С.В.", "Глущенка Сергія Вікторовича, місце проживання якого зареєстровано за адресою: місто Київ, вулиця Р. Окіпної, будинок 10, квартира 45, (паспорт СН 340646, виданий 10.12.1996 року Дарницьким РУ ГУ МВС України в м. Києві), реєстраційний номер облікової картки платника податків за даними Державного реєстру фізичних осіб-платників податків 2375803091, який діє на підставі довіреності, посвідченої 19 вересня 2018 року приватним нотаріусом Київського міського нотаріального округу Бочкарьовою Н.М. за реєстровим № 691"),
    Kulibaba("Кулібаба І.В.", "Кулібаби Ірини Володимирівни, яка діє на підставі довіреності, посвідченої 19 вересня 2018 року року Бочкарьовою Наталією Михайлівною, приватним нотаріусом Київського міського нотаріального округу, за реєстровим № 691"),
    Strukova("Біла І.В.", "Уповноваженої особи Фонду гарантування вкладів фізичних осіб на ліквідацію ПАТ «КБ «НАДРА» Білої Ірини Володимирівни, яка діє на підставі Закону України «Про систему гарантування вкладів фізичних осіб» та рішення виконавчої дирекції Фонду гарантування вкладів фізичних осіб №3383 від 17 грудня 2018 року «Про зміну уповноваженої особи Фонду на ліквідацію ПАТ «КБ «НАДРА», ");

    private String text;
    private String fio;

    private SignerBank(String fio, String text) {
        this.fio = fio;
        this.text = text;
    }

    public String getText() {
        return text;
    }
    public void setText(String text) {
        this.text = text;
    }

    public String getFio() {
        return fio;
    }
    public void setFio(String fio) {
        this.fio = fio;
    }
}
